"Featured":false
}{
"_id":{
   "$oid":"629be9fede79c56e4a1a8464"
},
"Title":"Hook",
"Description":"When Captain James Hook kidnaps his children, an adult Peter Pan must return to Neverland and reclaim his youthful spirit in order to challenge his old enemy.",
"Genre":{
   "Name":"Adventure",
   "Description":"The adventure genre consists of movies where the protagonist goes on an epic journey, either personally or geographically. Often the protagonist has a mission and faces many obstacles in his way."
},
"Director":{
   "Name":"Steven Spielberg",
   "Bio":"One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood/'s best known director and one of the wealthiest filmmakers in the world.",
   "Birth":"1946"
},
"Release":"1991",
"Rating":"PG",
"ImagePath":"Hook.jpg",
"Featured":true
}{
"_id":{
   "$oid":"629beadbde79c56e4a1a8465"
},
"Title":"The Princess Bride",
"Description":"While home sick in bed, a young boy/'s grandfather reads him the story of a farmboy-turned-pirate who encounters numerous obstacles, enemies and allies in his quest to be reunited with his true love.",
"Genre":{
   "Name":"Adventure",
   "Description":"The adventure genre consists of movies where the protagonist goes on an epic journey, either personally or geographically. Often the protagonist has a mission and faces many obstacles in his way."
},
"Director":{
   "Name":"Rob Reiner",
   "Bio":"Robert Norman Reiner is an American actor and filmmaker.",
   "Birth":"1947"
},
"Release":"1987",
"Rating":"PG",
"ImagePath":"Princess_Bride.jpeg",
"Featured":true
}{
"_id":{
   "$oid":"629bec5cde79c56e4a1a8466"
},
"Title":"Labyrinth",
"Description":"Sixteen-year-old Sarah is given thirteen hours to solve a labyrinth and rescue her baby brother Toby when her wish for him to be taken away is granted by the Goblin King Jareth.",
"Genre":{
   "Name":"Adventure",
   "Description":"The adventure genre consists of movies where the protagonist goes on an epic journey, either personally or geographically. Often the protagonist has a mission and faces many obstacles in his way."
},
"Director":{
   "Name":"Jim Henson",
   "Bio":"James Maury Henson was an American puppeteer, animator, cartoonist, actor, inventor, and screenwriter who achieved worldwide notice as the creator of The Muppets and Fraggle Rock and director of The Dark Crystal and Labyrinth.",
   "Birth":"1936",
   "Death":"1990"
},
"Release":"1986",
"ImagePath":"labyrinth.jpeg",
"Featured":true
}{
"_id":{
   "$oid":"629bed42de79c56e4a1a8467"
},
"Title":"The Other Guys",
"Description":"Two mismatched New York City detectives seize an opportunity to step up like the cities top cops, whom they idolize, only things don/'t quite go as planned.",
"Genre":{
   "Name":"Comedy",
   "Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."
},
"Director":{
   "Name":"Adam McKay",
   "Bio":"Adam McKay is an American screenwriter, director, comedian, and actor.",
   "Birth":"1968"
},
"Release":"2010",
"Rating":"PG-13",
"ImagePath":"theotherguys.jpeg",
"Featured":false
}{
"_id":{
   "$oid":"629bee2cde79c56e4a1a8468"
},
"Title":"A Simple Favor",
"Description":"Stephanie is a single mother with a parenting vlog who befriends Emily, a secretive upper-class woman who has a child at the same elementary school. When Emily goes missing, Stephanie takes it upon herself to investigate.",
"Genre":{
   "Name":"Mystery",
   "Description":"Mystery is a fiction genre where the nature of an event, usually a murder or other crime, remains mysterious until the end of the story. Often within a closed circle of suspects, each suspect is usually provided with a credible motive and a reasonable opportunity for committing the crime."
},
"Director":{
   "Name":"Paul Feig",
   "Bio":"Paul Feig is an American film director and writer who is known for creating Freaks and Geeks and directing Bridesmaids, The Heat, Spy and A Simple Favor.",
   "Birth":"1962"
},
"Release":"2018",
"Rating":"R",
"ImagePath":"SimpleFavor.jpeg",
"Featured":false
}{
"_id":{
   "$oid":"629beee3de79c56e4a1a8469"
},
"Title":"Toy Story",
"Description":"A cowboy doll is profoundly threatened and jealous when a new spaceman figure supplants him as top toy in a boy's room.",
"Genre":{
   "Name":"Animated",
   "Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."
},
"Director":{
   "Name":"John Lasseter",
   "Bio":"John Alan Lasseter is an American film director, producer, screenwriter, animator, voice actor, and the head of animation at Skydance Animation.",
   "Birth":"1957"
},
"Release":"1995",
"Rating":"G",
"ImagePath":"ToyStory.jpeg",
"Featured":false
}{
"_id":{
   "$oid":"629bef92de79c56e4a1a846a"
},
"Title":"Urban Legend",
"Description":"A college student suspects a series of bizarre deaths are connected to certain urban legends.",
"Genre":{
   "Name":"Thriller",
   "Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience. Tension is created by delaying what the audience sees as inevitable, and is built through situations that are menacing or where escape seems impossible."
},
"Director":{
   "Name":"Jamie Blanks",
   "Bio":"Jamie Blanks is an Australian film director and composer. He directed the cult slasher films Urban Legend and Valentine.",
   "Birth":"1971"
},
"Release":"1998",
"Rating":"R",
"ImagePath":"UrbanLegends.jpeg",
"Featured":false
}
